/**
 * \file
 * \brief OSBDM USB 设备
 *
 * \internal
 * \par Modification history
 * - 1.00 24-08-08  peace, first implementation
 * \endinternal
 */

#ifndef __USB_OSBDM
#define __USB_OSBDM

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
  头文件包含
*******************************************************************************/

#include <stdint.h>

/*******************************************************************************
  宏定义
*******************************************************************************/

/*******************************************************************************
  本地全局变量声明
*******************************************************************************/

/*******************************************************************************
  本地函数声明
*******************************************************************************/

/**
 * \brief 初始化 OSBDM USB
 *
 * \param[in] busid 总线 ID，范围 0 ~ (CONFIG_USBDEV_MAX_BUS - 1)
 */
int32_t usb_osbdm_ep_in_send (uint8_t *p_data, uint32_t length);

/**
 * \brief 初始化 OSBDM USB
 */
void usb_osbdm_init (void);

#ifdef __cplusplus
}
#endif

#endif /* __USB_OSBDM */

/* end of file */
